Revit 2027 API
Reference Properties
The SpecTypeId.Reference type exposes the following members.
Properties
Name | Description
FillPattern |  Fill Pattern, in discipline Common.
Image |  Image, in discipline Common.
LoadClassification |  Load Classification, in discipline Electrical.
Material |  Material, in discipline Common.
Top
See Also
Reference
SpecTypeId.Reference Class
Autodesk.Revit.DB Namespace